各位同事，
为协助完善公司能力线建设，做好人才储备及培养， 现启动建广数科2022-2023年度人才简历整理工作。请您仔细阅读下述内容并协助完成以下工作：
 
1.     具体事项：填写附件格式简历（Word+PPT）
1)     人员范围：除职能部门、销售人员以外的其他所有人员；
2)     如您此前已反馈过公司标准格式简历，则本次可在上一个版本的基础上，更新项目及其他内容（如证书类）后反馈；
3)     如您尚未填写过公司格式简历，本次请使用附件格式（Word+PPT），按照下方第2条简历填写要求来填写您的简历；
 
2.     简历填写要求：
1)     模板是以项目制描述工作经历，因此对于过往代表性项目或正进行的项目，请一定全面的填写在简历内容中；项目时间需由近及远；如果有行业背景经验，请重点描述，并请使用职业、规范语言；
2)     项目交付型岗位，请突出体现项目内容和岗位专业性；管理型岗位，请突出岗位专业性和项目管理能力；
3)     简历照片为正规1寸职业照，照片需符合以下条件：发型整洁、服装正规挺括，精神饱满；男士剃须，女士建议淡妆；整体风格简洁明亮、沉稳干练为宜。不要提交生活照或像素过低模糊的照片；
4)     对于有PA、PMP、RHCE、OCP、OCM、ITIL等证书，或其他国家承认的职称证书的，请在简历最下方提供证书扫描件（彩色最佳）；
5)     请不要对简历模板格式进行任何修改，注意简历名称按照“简历_+姓名+_技能模块”格式编写。
 
3.     如您是部门/团队负责人或部门助理，请协助下述事宜：
1)     请协助敦促团队人员的简历更新工作；
2)     对于团队人员的简历编写，请给予必要的指导；
3)     各团队的简历整理情况将上报作为年底考核指标。