package com.hspedu.homework;

public class Demo1 {
    static {
        System.out.println("静态代码块 111");
    }
    
    static {
        System.out.println("静态代码块 222");
    }
    
    {
        System.out.println("初始块 111");
    }
    
    {
        System.out.println("初始块 222");
    }
    
    public Demo1() {
        System.out.println("无参构造方法");
    }
    
    {
        System.out.println("初始块 3333");
    }
    
    public Demo1(int i) {
        System.out.println("有参构造方法" + i);
    }
    
    {
        System.out.println("初始块 4444");
    }
    
    public static void main(String[] args) {
        //new Demo1();
    
        System.out.println("某知名其他专业服务公司,央企正编Java,长沙,20-40K·15薪\\n中国联通,Java开发-正规央企-七险二金-福利待遇佳,长沙·岳麓区·麓谷,15-25K\\n老百姓大药房,高级/资深Java开发工程师,长沙·开福区·青竹湖,12-24K·13薪\\n益丰大药房,基础产品研发Java工程师（统招本科）,长沙·岳麓区·麓谷,16-22K·13薪\\n某大型知名医疗健康上市公司,java后端leader,长沙,22-27K·13薪\\n某知名文化公司,java开发（轻松不卷, 多HC急招）,长沙,20-35K\\n某大型知名银行上市公司,java开发工程师-央企，正式合同，965,长沙,25-35K\\n赢时胜,高级JAVA开发工程师-CS (MJ000162),长沙·开福区·伍家岭,20-30K\\n广立微,Java开发工程师+双休+实缴五险一金,长沙·岳麓区·麓谷,12-24K·16薪\\n华盛通,资深Java开发工程师（长沙）,长沙·岳麓区·麓谷,20-35K\\n趣丸,Java开发（中科云谷外包,长沙·岳麓区·桐梓坡,12-24K\\nWebull微步,Java高级开发/架构师,长沙·岳麓区·观沙岭,20-40K·15薪\\n某500强上市公司,java后端开发,长沙,20-21K\\n茶颜悦色,JAVA开发工程师,长沙·芙蓉区·定王台,15-25K\\n华为技术有限公司,Java开发（薪资高福利好）,长沙·岳麓区·麓谷,15-30K·14薪\\n某大型知名互联网金融上市公司,java工程师,长沙,20-40K·15薪\\n某大型知名通信上市公司,国企直招-java工程师,长沙,20-25K\\n某银行公司,java开发工程师,长沙,15-30K\\n卫宁健康,高级Java开发工程师,长沙·岳麓区·麓谷,15-30K·14薪\\n美团,java工程师,长沙·芙蓉区·定王台,12-24K·15薪\\n上海海典软件,长沙中高级JAVA开发工程师-HCBU,长沙·岳麓区·麓谷,15-25K·13薪\\n某大型知名移动互联网上市公司,Java架构-ZS,长沙,25-50K·14薪\\n美迈科技,资深研发工程师,长沙·岳麓区·麓谷,20-35K·13薪\\n三一集团,软件工程师 （后端 JAVA）,长沙·长沙县·星城国际,12-24K·14薪\\n兴盛优选,Java,长沙·岳麓区·青山镇,25-50K·18薪\\n计支宝,Java技术经理,长沙·天心区·省政府,20-40K\\n企知道,java开发工程师,长沙·开福区·湘雅路,20-30K·14薪\\n某知名运营商公司,java架构,长沙,35-45K·15薪\\n某500强上市公司,Java高级开发工程师,长沙,20-25K·14薪\\n威高,高级java研发工程师/架构师,长沙·岳麓区·梅溪湖,20-30K·14薪");
    }
}